Catalogs/ШаблоныВыплатПоДоговорамОпеки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Catalog>
		<Properties>
			<Name>ШаблоныВыплатПоДоговорамОпеки</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Выплаты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВыплачиваетсяПриВозрастеОт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВыплачиваетсяПриВозрастеДо</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособРасчета</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СпособыРасчетаВыплатПоДоговорамОпеки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПрожиточныйМинимум</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПрожиточныеМинимумы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Размер</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИсключаяДатуОт</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВключаяДатуДо</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/ВыплатыПоДоговорамОпекиКлиент/Ext/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

Процедура ВводОграниченийПоВозрасту(ПараметрыОграничений, ЭлементПредставления) Экспорт
		
	ОткрытьФорму("Справочник.ШаблоныВыплатПоДоговорамОпеки.Форма.РедактированиеОграниченийПоВозрасту", 
		ПараметрыОграничений, ЭлементПредставления, , , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

Функция ПараметрыОграниченийПоВозрасту() Экспорт
	
	ПараметрыОграничений = Новый Структура;
	ПараметрыОграничений.Вставить("ВозрастОт");
	ПараметрыОграничений.Вставить("ВозрастДо");
	ПараметрыОграничений.Вставить("ИсключаяДатуОт");
	ПараметрыОграничений.Вставить("ВключаяДатуДо");
	
	Возврат ПараметрыОграничений;

КонецФункции

Процедура ВводДанныхДляРасчетаРазмераВыплаты(ПараметрыРасчетаРазмераВыплаты, ЭлементПредставления) Экспорт
		
	ОткрытьФорму("Справочник.ШаблоныВыплатПоДоговорамОпеки.Форма.ВводДанныхДляРасчетаРазмераВыплаты", 
		ПараметрыРасчетаРазмераВыплаты, ЭлементПредставления, , , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

Функция СуммаВыплатыНаДатуРасчета(Размер, Коэффициент, ВозрастОт, ВозрастДо, ВозрастНаДатуРасчета) Экспорт
	Если ВозрастНаДатуРасчета=Неопределено Тогда 
		Если ВозрастОт=0 И ВозрастДо=0 Тогда
			Возврат Размер * Коэффициент;
		Иначе 
			Возврат 0;
		КонецЕсли;
	ИначеЕсли (ВозрастНаДатуРасчета>=ВозрастОт И ВозрастНаДатуРасчета<ВозрастДо)
			Или (ВозрастНаДатуРасчета>=ВозрастОт И ВозрастДо=0)  
			Или (ВозрастОт=0 И ВозрастНаДатуРасчета<ВозрастДо)  
			Или (ВозрастОт=0 И ВозрастДо=0) Тогда 
		Возврат Размер * Коэффициент;
	Иначе 
		Возврат 0;
	КонецЕсли;
КонецФункции	
	
#КонецОбласти
